{
  "Home": {
    "bannerIntro": "Olá, eu sou ",
    "changingTitle": "Desenvolvedor <span className='text-[#A6A6A6] after:content-[`|`] after:animate-blinking'>{displayedStack}</span>",
    "intro": "Olá e bem-vindo!",
    "bannerDisclaimer": "Com paixão pelo desenvolvimento front-end, soluções de e-commerce e experiências imersivas de jogos, eu me esforço para criar soluções digitais memoráveis e envolventes.",
    "collaborationDisclaimer": "Vamos colaborar e trazer seu projeto a vida!",
    "contactCTA": "Vamos conversar!",
    "serviceCardTitle1": "Desenvolvimento Front-end",
    "serviceCardSubtitle1": "Criando interfaces de usuário intuitivas e atraentes usando React e NextJS.",
    "serviceCardTitle2": "Desenvolvimento de E-commerce",
    "serviceCardSubtitle2": "Lojas onlines integradas com pagamento seguro e UX intuitivo.",
    "serviceCardTitle3": "Desenvolvimento de jogos",
    "serviceCardSubtitle3": "Experiências imersivas com mecânicas, gráficos e interfaces atraentes.",
    "servicesCTA": "Veja o meu trabalho!",
    "homePrefix": "Ultimos",
    "homeSuffix": "cases.",
    "casesCTA": "Veja todos os cases!",
    "homeStacksPrefix": "Minhas",
    "homeStacksSuffix": "stacks.",
    "languages": "Linguagens",
    "languageSubtitle1": "Linguagem de script popular usada para desenvolvimento web e além.",
    "languageSubtitle2": "Superset do JavaScript com adição de anotações de tipo para maior confiabilidade.",
    "languageSubtitle3": "Linguagem de programação orientada a objetos usada para construir aplicativos Windows desktop e web.",
    "frameworkSubtitle1": "Biblioteca JavaScript usada para construir interfaces de usuário dinâmicas e interativas.",
    "frameworkSubtitle2": "Framework construído em cima do React para renderização do lado do servidor e geração de sites estáticos.",
    "frameworkSubtitle3": "Framework CSS utility-first para desenvolvimento rápido de interfaces de usuário.",
    "frameworkSubtitle4": "Framework para construção de aplicativos Windows desktop e web, usando C# e outras linguagens.",
    "frontEndSubtitle1": "Pré-processadores CSS que adicionam funcionalidade e eficiência à autoria de folhas de estilo.",
    "frontEndSubtitle2": "Biblioteca cliente-side para usar GraphQL em aplicativos JavaScript.",
    "frontEndSubtitle3": "Frameworks de teste JavaScript para testar componentes e aplicativos React.",
    "frontEndSubtitle4": "Contêiner de estado previsível para aplicativos JavaScript, tornando o gerenciamento de estado mais organizado e mantido.",
    "frontEndSubtitle5": "Ferramentas que agrupam, otimizam e transformam ativos JavaScript e CSS para uso no navegador.",
    "backEndSubtitle1": "Ambiente de tempo de execução JavaScript para construção de aplicativos escaláveis do lado do servidor.",
    "backEndSubtitle2": "Banco de dados NoSQL baseado em documentos usado para armazenar e recuperar grandes quantidades de dados em tempo real.",
    "backEndSubtitle3": "Biblioteca do lado do servidor para implementar APIs GraphQL em aplicativos JavaScript.",
    "gameSubtitle1": "Motor de jogo multiplataforma para construção de jogos 2D e 3D para plataformas desktop, móveis e de console.",
    "gameSubtitle2": "Motor de jogo usado para desenvolver jogos 3D de alta fidelidade com simulações avançadas de gráficos e física."
  }
}
